//              Lab2 Print Sum & Diff
ผลรวมทั่งหมด
let sum = 0;
for(let i = 1; i <=100;i++){
    sum +=i;
}
console.log(`ผลรวมของตั้งแต่ 1 ถึง 100 คือ: ${sum}`);
// ans 5050

ผลรวมเฉพราะเลขคู่
let sumK = 0;
for(let i = 2; i <= 100; i += 2 ){
    sumK += i;
}
console.log(`ผลรวมของเลขคู่ตั้งแต่ 1 ถึง 100 คือ: ${sumK}`)
// ans 2550

ผลรวมเฉพราะเลขคี่
let sumk = 0;
for(let i = 1; i <= 100; i += 2){
    sumk += i;
}
console.log(`ผลรวมของเลขคี่ตั้งแต่ 1 ถึง 100 คือ: ${sumk}`)
// ans 2500

// กำหนดตัวแปรเพื่อเก็บผลรวม
let sum1 = 0;
let sum2 = 0;
// หาผลรวมของเลขที่หารด้วย 2 ลงตัว ยกกำลัง 2
for (let i = 2; i <= 100; i += 2) {
    sum1 += Math.pow(i, 2);
}
// หาผลรวมของเลขที่หารด้วย 3 ลงตัว ยกกำลัง 2
for (let j = 3; j <= 100; j += 3) {
    sum2 += Math.pow(j, 2);
}
// คำนวณผลรวมทั้งหมด
let result = sum1 - sum2;
// แสดงผลลัพธ์
console.log(`ผลรวมของเลขที่หารด้วย 2 ลงตัว ยกกำลัง 2 :${sum1} - ผลรวมของเลขที่หารด้วย 3 ลงตัว ยกกำลัง 2 : ${sum2} คือ: ${result}`);
//ans ผลรวมของเลขที่หารด้วย 2 ลงตัว ยกกำลัง 2 :171700 -ผลรวมของเลขที่หารด้วย 3 ลงตัว ยกกำลัง 2 : 112761 คือ: 58939
